app/controllers/reviews_controller.rb

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`created_at`, `nickname`, `product_id`, `rate`, `review`, `updated_at`) VALUES ('2016-08-10 14:50:33', 'shun', 3, 7, 'しみじみ。', '2016-08-10 14:50:33')